In [9]:
import numpy as np
import pandas as pd

In [10]:
# build a dataframe by dict

data = {
    "Country": ['China', 'India', 'Brazil'],
    "Capital": ['Bejing', 'New Delhi', 'Brazilia'],
    "Population": [1432732201, 13031716635, 1207847528]
    
}

In [11]:
df = pd.DataFrame(data)
# automatically map keys to df columns

In [12]:
df

  Country    Capital   Population
0   China     Bejing   1432732201
1   India  New Delhi  13031716635
2  Brazil   Brazilia   1207847528

In [13]:
df.index = ['A', 'B', 'C']

In [14]:
df

  Country    Capital   Population
A   China     Bejing   1432732201
B   India  New Delhi  13031716635
C  Brazil   Brazilia   1207847528

In [15]:
# slice df by number index

df.iloc[0:2, 1:]

     Capital   Population
A     Bejing   1432732201
B  New Delhi  13031716635

In [16]:
# slice df by attribute-like index

df.loc['A']

Country            China
Capital           Bejing
Population    1432732201
Name: A, dtype: object

In [17]:
# check df.loc['A'] type
type(df.loc['A'])

pandas.core.series.Series

- dataframe row/columns的取值返回結果都是series
- 反過來說，n series也可以組合成一個dataframe

In [35]:
data

{'Country': ['China', 'India', 'Brazil'],
 'Capital': ['Bejing', 'New Delhi', 'Brazilia'],
 'Population': [1432732201, 13031716635, 1207847528]}

In [41]:
# dict to series

s1 = pd.Series(data['Country'])
s2 = pd.Series(data['Capital'])
s3 = pd.Series(data['Population'])

# gen. df by list of series
df_new = pd.DataFrame([s1, s2, s3])

In [42]:
df_new

            0            1           2
0       China        India      Brazil
1      Bejing    New Delhi    Brazilia
2  1432732201  13031716635  1207847528

In [43]:
# assign columns
df_new.columns = ['Country', 'Capital', 'Population']

In [44]:
df_new

      Country      Capital  Population
0       China        India      Brazil
1      Bejing    New Delhi    Brazilia
2  1432732201  13031716635  1207847528